; domain
;; Enrico Scala (enricos83@gmail.com)
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;; counters-ineq-rnd domain, functional strips version
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;; This domain describes a set of counters that can be increased and decreased. The rate of such counter is however variable!

(define (domain fo-counters-rnd)
    (:requirements :strips :typing :fluents :adl)
    (:types counter)

    (:functions
        (value ?c - counter);; - int  ;; The value shown in counter ?c
        (rate_value ?c - counter);;
        (max_int);; -  int ;; The maximum integer we consider - a static value
    )

    ;; Increment the value in the given counter by one
    (:action increment
         :parameters (?c - counter)
         :precondition (and (<= (+ (value ?c) (rate_value ?c)) (max_int)))
         :effect (and (increase (value ?c) (rate_value ?c)))
    )
    ;; Decrement the value in the given counter by one
    (:action decrement
         :parameters (?c - counter)
         :precondition (and (>= (- (value ?c) (rate_value ?c)) 0))
         :effect (and (decrease (value ?c) (rate_value ?c)))
    )

    (:action increase_rate
         :parameters (?c - counter)
         :precondition (and (<= (+ (rate_value ?c) 1) 10))
         :effect (and (increase (rate_value ?c) 1))
    )

    (:action decrement_rate
         :parameters (?c - counter)
         :precondition (and (>= (rate_value ?c) 1))
         :effect (and (decrease (rate_value ?c) 1))
    )


)

; problem
;; Enrico Scala (enricos83@gmail.com) and Miquel Ramirez (miquel.ramirez@gmail.com)
(define (problem instance_16_100)
	(:domain fo-counters-rnd)
	(:objects
		c0 c1 c2 c3 c4 c5 c6 c7 c8 c9 c10 c11 c12 c13 c14 c15 - counter
	)
  (:init
		(= (value c0) 85)
	(= (value c1) 79)
	(= (value c2) 55)
	(= (value c3) 12)
	(= (value c4) 57)
	(= (value c5) 96)
	(= (value c6) 5)
	(= (value c7) 86)
	(= (value c8) 43)
	(= (value c9) 85)
	(= (value c10) 75)
	(= (value c11) 59)
	(= (value c12) 6)
	(= (value c13) 12)
	(= (value c14) 23)
	(= (value c15) 53)

        (= (rate_value c0) 0)
	(= (rate_value c1) 0)
	(= (rate_value c2) 0)
	(= (rate_value c3) 0)
	(= (rate_value c4) 0)
	(= (rate_value c5) 0)
	(= (rate_value c6) 0)
	(= (rate_value c7) 0)
	(= (rate_value c8) 0)
	(= (rate_value c9) 0)
	(= (rate_value c10) 0)
	(= (rate_value c11) 0)
	(= (rate_value c12) 0)
	(= (rate_value c13) 0)
	(= (rate_value c14) 0)
	(= (rate_value c15) 0)

		(= (max_int) 100)
	)
	(:goal
		(and
			(<= (+ (value c0) 1) (value c1))
	(<= (+ (value c1) 1) (value c2))
	(<= (+ (value c2) 1) (value c3))
	(<= (+ (value c3) 1) (value c4))
	(<= (+ (value c4) 1) (value c5))
	(<= (+ (value c5) 1) (value c6))
	(<= (+ (value c6) 1) (value c7))
	(<= (+ (value c7) 1) (value c8))
	(<= (+ (value c8) 1) (value c9))
	(<= (+ (value c9) 1) (value c10))
	(<= (+ (value c10) 1) (value c11))
	(<= (+ (value c11) 1) (value c12))
	(<= (+ (value c12) 1) (value c13))
	(<= (+ (value c13) 1) (value c14))
	(<= (+ (value c14) 1) (value c15))
		)
	)
)

; plan
1. (increase_rate c12)
   changed: (rate_value c12) from 0 to 1
   goals met: 7 of 15
2. (increase_rate c12)
   changed: (rate_value c12) from 1 to 2
   goals met: 7 of 15
3. (increase_rate c12)
   changed: (rate_value c12) from 2 to 3
   goals met: 7 of 15
4. (increase_rate c12)
   changed: (rate_value c12) from 3 to 4
   goals met: 7 of 15
5. (increase_rate c12)
   changed: (rate_value c12) from 4 to 5
   goals met: 7 of 15
6. (increase_rate c12)
   changed: (rate_value c12) from 5 to 6
   goals met: 7 of 15
7. (increase_rate c10)
   changed: (rate_value c10) from 0 to 1
   goals met: 7 of 15
8. (increase_rate c10)
   changed: (rate_value c10) from 1 to 2
   goals met: 7 of 15
9. (increase_rate c10)
   changed: (rate_value c10) from 2 to 3
   goals met: 7 of 15
10. (increase_rate c10)
   changed: (rate_value c10) from 3 to 4
   goals met: 7 of 15
11. (increase_rate c10)
   changed: (rate_value c10) from 4 to 5
   goals met: 7 of 15
12. (increase_rate c10)
   changed: (rate_value c10) from 5 to 6
   goals met: 7 of 15
13. (increment c10)
   changed: (value c10) from 75 to 81
   goals met: 7 of 15
14. (increase_rate c0)
   changed: (rate_value c0) from 0 to 1
   goals met: 7 of 15
15. (increase_rate c0)
   changed: (rate_value c0) from 1 to 2
   goals met: 7 of 15
16. (increase_rate c0)
   changed: (rate_value c0) from 2 to 3
   goals met: 7 of 15
17. (increase_rate c0)
   changed: (rate_value c0) from 3 to 4
   goals met: 7 of 15
18. (decrement c0)
   changed: (value c0) from 85 to 81
   goals met: 7 of 15
19. (decrement c0)
   changed: (value c0) from 81 to 77
   goals met: 8 of 15
20. (increase_rate c12)
   changed: (rate_value c12) from 6 to 7
   goals met: 8 of 15
21. (increase_rate c12)
   changed: (rate_value c12) from 7 to 8
   goals met: 8 of 15
22. (increment c12)
   changed: (value c12) from 6 to 14
   goals met: 7 of 15
23. (increase_rate c11)
   changed: (rate_value c11) from 0 to 1
   goals met: 7 of 15
24. (increase_rate c11)
   changed: (rate_value c11) from 1 to 2
   goals met: 7 of 15
25. (increase_rate c11)
   changed: (rate_value c11) from 2 to 3
   goals met: 7 of 15
26. (increment c12)
   changed: (value c12) from 14 to 22
   goals met: 7 of 15
27. (increment c10)
   changed: (value c10) from 81 to 87
   goals met: 8 of 15
28. (increase_rate c10)
   changed: (rate_value c10) from 6 to 7
   goals met: 8 of 15
29. (decrement c10)
   changed: (value c10) from 87 to 80
   goals met: 7 of 15
30. (increase_rate c13)
   changed: (rate_value c13) from 0 to 1
   goals met: 7 of 15
31. (increase_rate c13)
   changed: (rate_value c13) from 1 to 2
   goals met: 7 of 15
32. (increase_rate c13)
   changed: (rate_value c13) from 2 to 3
   goals met: 7 of 15
33. (increase_rate c10)
   changed: (rate_value c10) from 7 to 8
   goals met: 7 of 15
34. (increase_rate c10)
   changed: (rate_value c10) from 8 to 9
   goals met: 7 of 15
35. (increase_rate c10)
   changed: (rate_value c10) from 9 to 10
   goals met: 7 of 15
36. (increase_rate c12)
   changed: (rate_value c12) from 8 to 9
   goals met: 7 of 15
37. (increment c12)
   changed: (value c12) from 22 to 31
   goals met: 7 of 15
38. (decrement c11)
   changed: (value c11) from 59 to 56
   goals met: 7 of 15
39. (increase_rate c12)
   changed: (rate_value c12) from 9 to 10
   goals met: 7 of 15
40. (increase_rate c13)
   changed: (rate_value c13) from 3 to 4
   goals met: 7 of 15
41. (increase_rate c13)
   changed: (rate_value c13) from 4 to 5
   goals met: 7 of 15
42. (increment c13)
   changed: (value c13) from 12 to 17
   goals met: 7 of 15
43. (increase_rate c8)
   changed: (rate_value c8) from 0 to 1
   goals met: 7 of 15
44. (increase_rate c8)
   changed: (rate_value c8) from 1 to 2
   goals met: 7 of 15
45. (increase_rate c7)
   changed: (rate_value c7) from 0 to 1
   goals met: 7 of 15
46. (increase_rate c8)
   changed: (rate_value c8) from 2 to 3
   goals met: 7 of 15
47. (increase_rate c8)
   changed: (rate_value c8) from 3 to 4
   goals met: 7 of 15
48. (increase_rate c7)
   changed: (rate_value c7) from 1 to 2
   goals met: 7 of 15
49. (increase_rate c7)
   changed: (rate_value c7) from 2 to 3
   goals met: 7 of 15
50. (increase_rate c8)
   changed: (rate_value c8) from 4 to 5
   goals met: 7 of 15
51. (increase_rate c8)
   changed: (rate_value c8) from 5 to 6
   goals met: 7 of 15
52. (increment c8)
   changed: (value c8) from 43 to 49
   goals met: 7 of 15
53. (increment c8)
   changed: (value c8) from 49 to 55
   goals met: 7 of 15
54. (increment c8)
   changed: (value c8) from 55 to 61
   goals met: 7 of 15
55. (increment c8)
   changed: (value c8) from 61 to 67
   goals met: 7 of 15
56. (increment c8)
   changed: (value c8) from 67 to 73
   goals met: 7 of 15
57. (increment c8)
   changed: (value c8) from 73 to 79
   goals met: 7 of 15
58. (increment c8)
   changed: (value c8) from 79 to 85
   goals met: 6 of 15
59. (decrement c7)
   changed: (value c7) from 86 to 83
   goals met: 7 of 15
60. (increase_rate c3)
   changed: (rate_value c3) from 0 to 1
   goals met: 7 of 15
61. (increase_rate c3)
   changed: (rate_value c3) from 1 to 2
   goals met: 7 of 15
62. (increase_rate c2)
   changed: (rate_value c2) from 0 to 1
   goals met: 7 of 15
63. (increase_rate c3)
   changed: (rate_value c3) from 2 to 3
   goals met: 7 of 15
64. (increase_rate c3)
   changed: (rate_value c3) from 3 to 4
   goals met: 7 of 15
65. (increase_rate c1)
   changed: (rate_value c1) from 0 to 1
   goals met: 7 of 15
66. (increase_rate c1)
   changed: (rate_value c1) from 1 to 2
   goals met: 7 of 15
67. (increase_rate c1)
   changed: (rate_value c1) from 2 to 3
   goals met: 7 of 15
68. (decrement_rate c2)
   changed: (rate_value c2) from 1 to 0
   goals met: 7 of 15
69. (increase_rate c3)
   changed: (rate_value c3) from 4 to 5
   goals met: 7 of 15
70. (increase_rate c3)
   changed: (rate_value c3) from 5 to 6
   goals met: 7 of 15
71. (increment c3)
   changed: (value c3) from 12 to 18
   goals met: 7 of 15
72. (increase_rate c3)
   changed: (rate_value c3) from 6 to 7
   goals met: 7 of 15
73. (increase_rate c3)
   changed: (rate_value c3) from 7 to 8
   goals met: 7 of 15
74. (increment c3)
   changed: (value c3) from 18 to 26
   goals met: 7 of 15
75. (increment c3)
   changed: (value c3) from 26 to 34
   goals met: 7 of 15
76. (increment c3)
   changed: (value c3) from 34 to 42
   goals met: 7 of 15
77. (increment c3)
   changed: (value c3) from 42 to 50
   goals met: 7 of 15
78. (increase_rate c2)
   changed: (rate_value c2) from 0 to 1
   goals met: 7 of 15
79. (increase_rate c2)
   changed: (rate_value c2) from 1 to 2
   goals met: 7 of 15
80. (increase_rate c2)
   changed: (rate_value c2) from 2 to 3
   goals met: 7 of 15
81. (increase_rate c2)
   changed: (rate_value c2) from 3 to 4
   goals met: 7 of 15
82. (increment c3)
   changed: (value c3) from 50 to 58
   goals met: 7 of 15
83. (increase_rate c2)
   changed: (rate_value c2) from 4 to 5
   goals met: 7 of 15
84. (increase_rate c2)
   changed: (rate_value c2) from 5 to 6
   goals met: 7 of 15
85. (increment c2)
   changed: (value c2) from 55 to 61
   goals met: 6 of 15
86. (decrement c3)
   changed: (value c3) from 58 to 50
   goals met: 7 of 15
87. (decrement c8)
   changed: (value c8) from 85 to 79
   goals met: 7 of 15
88. (decrement c7)
   changed: (value c7) from 83 to 80
   goals met: 7 of 15
89. (decrement c7)
   changed: (value c7) from 80 to 77
   goals met: 8 of 15
90. (increase_rate c11)
   changed: (rate_value c11) from 3 to 4
   goals met: 8 of 15
91. (increase_rate c11)
   changed: (rate_value c11) from 4 to 5
   goals met: 8 of 15
92. (increment c11)
   changed: (value c11) from 56 to 61
   goals met: 8 of 15
93. (increment c10)
   changed: (value c10) from 80 to 90
   goals met: 9 of 15
94. (increase_rate c6)
   changed: (rate_value c6) from 0 to 1
   goals met: 9 of 15
95. (increase_rate c6)
   changed: (rate_value c6) from 1 to 2
   goals met: 9 of 15
96. (increase_rate c6)
   changed: (rate_value c6) from 2 to 3
   goals met: 9 of 15
97. (increase_rate c6)
   changed: (rate_value c6) from 3 to 4
   goals met: 9 of 15
98. (increase_rate c6)
   changed: (rate_value c6) from 4 to 5
   goals met: 9 of 15
99. (increase_rate c6)
   changed: (rate_value c6) from 5 to 6
   goals met: 9 of 15
100. (increase_rate c6)
   changed: (rate_value c6) from 6 to 7
   goals met: 9 of 15
101. (increase_rate c6)
   changed: (rate_value c6) from 7 to 8
   goals met: 9 of 15
102. (increase_rate c6)
   changed: (rate_value c6) from 8 to 9
   goals met: 9 of 15
103. (increase_rate c6)
   changed: (rate_value c6) from 9 to 10
   goals met: 9 of 15
104. (increment c6)
   changed: (value c6) from 5 to 15
   goals met: 9 of 15
105. (increment c6)
   changed: (value c6) from 15 to 25
   goals met: 9 of 15
106. (increment c6)
   changed: (value c6) from 25 to 35
   goals met: 9 of 15
107. (increment c6)
   changed: (value c6) from 35 to 45
   goals met: 9 of 15
108. (increment c6)
   changed: (value c6) from 45 to 55
   goals met: 9 of 15
109. (increment c6)
   changed: (value c6) from 55 to 65
   goals met: 9 of 15
110. (increase_rate c5)
   changed: (rate_value c5) from 0 to 1
   goals met: 9 of 15
111. (increase_rate c5)
   changed: (rate_value c5) from 1 to 2
   goals met: 9 of 15
112. (increment c6)
   changed: (value c6) from 65 to 75
   goals met: 9 of 15
113. (increment c6)
   changed: (value c6) from 75 to 85
   goals met: 8 of 15
114. (increase_rate c2)
   changed: (rate_value c2) from 6 to 7
   goals met: 8 of 15
115. (increase_rate c2)
   changed: (rate_value c2) from 7 to 8
   goals met: 8 of 15
116. (increase_rate c2)
   changed: (rate_value c2) from 8 to 9
   goals met: 8 of 15
117. (increase_rate c2)
   changed: (rate_value c2) from 9 to 10
   goals met: 8 of 15
118. (increment c3)
   changed: (value c3) from 50 to 58
   goals met: 7 of 15
119. (increment c2)
   changed: (value c2) from 61 to 71
   goals met: 7 of 15
120. (increment c3)
   changed: (value c3) from 58 to 66
   goals met: 7 of 15
121. (increase_rate c4)
   changed: (rate_value c4) from 0 to 1
   goals met: 7 of 15
122. (increase_rate c4)
   changed: (rate_value c4) from 1 to 2
   goals met: 7 of 15
123. (increment c2)
   changed: (value c2) from 71 to 81
   goals met: 8 of 15
124. (increase_rate c11)
   changed: (rate_value c11) from 5 to 6
   goals met: 8 of 15
125. (increase_rate c11)
   changed: (rate_value c11) from 6 to 7
   goals met: 8 of 15
126. (increase_rate c11)
   changed: (rate_value c11) from 7 to 8
   goals met: 8 of 15
127. (increase_rate c11)
   changed: (rate_value c11) from 8 to 9
   goals met: 8 of 15
128. (increase_rate c11)
   changed: (rate_value c11) from 9 to 10
   goals met: 8 of 15
129. (decrement c10)
   changed: (value c10) from 90 to 80
   goals met: 7 of 15
130. (increment c13)
   changed: (value c13) from 17 to 22
   goals met: 7 of 15
131. (increment c10)
   changed: (value c10) from 80 to 90
   goals met: 8 of 15
132. (decrement c12)
   changed: (value c12) from 31 to 21
   goals met: 9 of 15
133. (decrement c11)
   changed: (value c11) from 61 to 51
   goals met: 9 of 15
134. (increment c7)
   changed: (value c7) from 77 to 80
   goals met: 8 of 15
135. (increment c8)
   changed: (value c8) from 79 to 85
   goals met: 8 of 15
136. (increment c7)
   changed: (value c7) from 80 to 83
   goals met: 8 of 15
137. (increment c6)
   changed: (value c6) from 85 to 95
   goals met: 8 of 15
138. (decrement c5)
   changed: (value c5) from 96 to 94
   goals met: 9 of 15
139. (increment c7)
   changed: (value c7) from 83 to 86
   goals met: 8 of 15
140. (increment c8)
   changed: (value c8) from 85 to 91
   goals met: 9 of 15
141. (increase_rate c8)
   changed: (rate_value c8) from 6 to 7
   goals met: 9 of 15
142. (decrement c8)
   changed: (value c8) from 91 to 84
   goals met: 9 of 15
143. (decrement c7)
   changed: (value c7) from 86 to 83
   goals met: 10 of 15
144. (increment c4)
   changed: (value c4) from 57 to 59
   goals met: 10 of 15
145. (increment c4)
   changed: (value c4) from 59 to 61
   goals met: 10 of 15
146. (increment c4)
   changed: (value c4) from 61 to 63
   goals met: 10 of 15
147. (increment c4)
   changed: (value c4) from 63 to 65
   goals met: 10 of 15
148. (increment c4)
   changed: (value c4) from 65 to 67
   goals met: 11 of 15
149. (increment c7)
   changed: (value c7) from 83 to 86
   goals met: 10 of 15
150. (increment c8)
   changed: (value c8) from 84 to 91
   goals met: 10 of 15
151. (decrement c6)
   changed: (value c6) from 95 to 85
   goals met: 10 of 15
152. (decrement c5)
   changed: (value c5) from 94 to 92
   goals met: 10 of 15
153. (decrement c5)
   changed: (value c5) from 92 to 90
   goals met: 10 of 15
154. (decrement c5)
   changed: (value c5) from 90 to 88
   goals met: 10 of 15
155. (decrement c5)
   changed: (value c5) from 88 to 86
   goals met: 10 of 15
156. (decrement c5)
   changed: (value c5) from 86 to 84
   goals met: 11 of 15
157. (increment c3)
   changed: (value c3) from 66 to 74
   goals met: 10 of 15
158. (increment c3)
   changed: (value c3) from 74 to 82
   goals met: 11 of 15
159. (increase_rate c4)
   changed: (rate_value c4) from 2 to 3
   goals met: 11 of 15
160. (increase_rate c4)
   changed: (rate_value c4) from 3 to 4
   goals met: 11 of 15
161. (increment c4)
   changed: (value c4) from 67 to 71
   goals met: 11 of 15
162. (increment c4)
   changed: (value c4) from 71 to 75
   goals met: 11 of 15
163. (increment c4)
   changed: (value c4) from 75 to 79
   goals met: 11 of 15
164. (increment c4)
   changed: (value c4) from 79 to 83
   goals met: 12 of 15
165. (decrement c11)
   changed: (value c11) from 51 to 41
   goals met: 12 of 15
166. (decrement c11)
   changed: (value c11) from 41 to 31
   goals met: 12 of 15
167. (decrement c10)
   changed: (value c10) from 90 to 80
   goals met: 11 of 15
168. (decrement_rate c11)
   changed: (rate_value c11) from 10 to 9
   goals met: 11 of 15
169. (increment c11)
   changed: (value c11) from 31 to 40
   goals met: 11 of 15
170. (increase_rate c11)
   changed: (rate_value c11) from 9 to 10
   goals met: 11 of 15
171. (decrement_rate c10)
   changed: (rate_value c10) from 10 to 9
   goals met: 11 of 15
172. (increment c10)
   changed: (value c10) from 80 to 89
   goals met: 12 of 15
173. (increase_rate c10)
   changed: (rate_value c10) from 9 to 10
   goals met: 12 of 15
174. (decrement c10)
   changed: (value c10) from 89 to 79
   goals met: 11 of 15
175. (increment c12)
   changed: (value c12) from 21 to 31
   goals met: 10 of 15
176. (increment c13)
   changed: (value c13) from 22 to 27
   goals met: 9 of 15
177. (increment c13)
   changed: (value c13) from 27 to 32
   goals met: 10 of 15
178. (increase_rate c14)
   changed: (rate_value c14) from 0 to 1
   goals met: 10 of 15
179. (increase_rate c14)
   changed: (rate_value c14) from 1 to 2
   goals met: 10 of 15
180. (increase_rate c14)
   changed: (rate_value c14) from 2 to 3
   goals met: 10 of 15
181. (increase_rate c14)
   changed: (rate_value c14) from 3 to 4
   goals met: 10 of 15
182. (increase_rate c14)
   changed: (rate_value c14) from 4 to 5
   goals met: 10 of 15
183. (increment c14)
   changed: (value c14) from 23 to 28
   goals met: 10 of 15
184. (increment c14)
   changed: (value c14) from 28 to 33
   goals met: 11 of 15
185. (increment c11)
   changed: (value c11) from 40 to 50
   goals met: 11 of 15
186. (increment c10)
   changed: (value c10) from 79 to 89
   goals met: 12 of 15
187. (increment c12)
   changed: (value c12) from 31 to 41
   goals met: 11 of 15
188. (increment c13)
   changed: (value c13) from 32 to 37
   goals met: 10 of 15
189. (increment c14)
   changed: (value c14) from 33 to 38
   goals met: 11 of 15
190. (increment c13)
   changed: (value c13) from 37 to 42
   goals met: 11 of 15
191. (increment c14)
   changed: (value c14) from 38 to 43
   goals met: 12 of 15
192. (increment c11)
   changed: (value c11) from 50 to 60
   goals met: 12 of 15
193. (decrement c10)
   changed: (value c10) from 89 to 79
   goals met: 11 of 15
194. (increment c12)
   changed: (value c12) from 41 to 51
   goals met: 10 of 15
195. (increment c13)
   changed: (value c13) from 42 to 47
   goals met: 9 of 15
196. (increment c14)
   changed: (value c14) from 43 to 48
   goals met: 10 of 15
197. (increment c13)
   changed: (value c13) from 47 to 52
   goals met: 10 of 15
198. (increment c14)
   changed: (value c14) from 48 to 53
   goals met: 10 of 15
199. (increment c12)
   changed: (value c12) from 51 to 61
   goals met: 10 of 15
200. (increment c13)
   changed: (value c13) from 52 to 57
   goals met: 9 of 15
201. (increment c14)
   changed: (value c14) from 53 to 58
   goals met: 10 of 15
202. (increase_rate c15)
   changed: (rate_value c15) from 0 to 1
   goals met: 10 of 15
203. (increment c15)
   changed: (value c15) from 53 to 54
   goals met: 10 of 15
204. (increment c11)
   changed: (value c11) from 60 to 70
   goals met: 9 of 15
205. (increment c10)
   changed: (value c10) from 79 to 89
   goals met: 10 of 15
206. (increment c15)
   changed: (value c15) from 54 to 55
   goals met: 10 of 15
207. (increment c13)
   changed: (value c13) from 57 to 62
   goals met: 10 of 15
208. (increment c14)
   changed: (value c14) from 58 to 63
   goals met: 11 of 15
209. (increase_rate c15)
   changed: (rate_value c15) from 1 to 2
   goals met: 11 of 15
210. (increase_rate c15)
   changed: (rate_value c15) from 2 to 3
   goals met: 11 of 15
211. (increment c15)
   changed: (value c15) from 55 to 58
   goals met: 11 of 15
212. (increment c15)
   changed: (value c15) from 58 to 61
   goals met: 11 of 15
213. (increment c15)
   changed: (value c15) from 61 to 64
   goals met: 12 of 15
214. (increment c11)
   changed: (value c11) from 70 to 80
   goals met: 12 of 15
215. (decrement c10)
   changed: (value c10) from 89 to 79
   goals met: 12 of 15
216. (increment c12)
   changed: (value c12) from 61 to 71
   goals met: 11 of 15
217. (increment c13)
   changed: (value c13) from 62 to 67
   goals met: 10 of 15
218. (increment c14)
   changed: (value c14) from 63 to 68
   goals met: 10 of 15
219. (increment c15)
   changed: (value c15) from 64 to 67
   goals met: 10 of 15
220. (increment c15)
   changed: (value c15) from 67 to 70
   goals met: 11 of 15
221. (increment c13)
   changed: (value c13) from 67 to 72
   goals met: 11 of 15
222. (increment c14)
   changed: (value c14) from 68 to 73
   goals met: 11 of 15
223. (increment c15)
   changed: (value c15) from 70 to 73
   goals met: 11 of 15
224. (increment c15)
   changed: (value c15) from 73 to 76
   goals met: 12 of 15
225. (increment c10)
   changed: (value c10) from 79 to 89
   goals met: 12 of 15
226. (increment c11)
   changed: (value c11) from 80 to 90
   goals met: 13 of 15
227. (increment c12)
   changed: (value c12) from 71 to 81
   goals met: 12 of 15
228. (increment c13)
   changed: (value c13) from 72 to 77
   goals met: 11 of 15
229. (increment c14)
   changed: (value c14) from 73 to 78
   goals met: 11 of 15
230. (increment c15)
   changed: (value c15) from 76 to 79
   goals met: 12 of 15
231. (increment c13)
   changed: (value c13) from 77 to 82
   goals met: 12 of 15
232. (increment c14)
   changed: (value c14) from 78 to 83
   goals met: 12 of 15
233. (increment c15)
   changed: (value c15) from 79 to 82
   goals met: 12 of 15
234. (increment c15)
   changed: (value c15) from 82 to 85
   goals met: 13 of 15
235. (increment c12)
   changed: (value c12) from 81 to 91
   goals met: 13 of 15
236. (increment c13)
   changed: (value c13) from 82 to 87
   goals met: 12 of 15
237. (increment c14)
   changed: (value c14) from 83 to 88
   goals met: 12 of 15
238. (increment c15)
   changed: (value c15) from 85 to 88
   goals met: 12 of 15
239. (increment c15)
   changed: (value c15) from 88 to 91
   goals met: 13 of 15
240. (increment c13)
   changed: (value c13) from 87 to 92
   goals met: 13 of 15
241. (increment c14)
   changed: (value c14) from 88 to 93
   goals met: 13 of 15
242. (increment c15)
   changed: (value c15) from 91 to 94
   goals met: 14 of 15
243. (decrement c8)
   changed: (value c8) from 91 to 84
   goals met: 14 of 15
244. (decrement c7)
   changed: (value c7) from 86 to 83
   goals met: 14 of 15
245. (decrement c6)
   changed: (value c6) from 85 to 75
   goals met: 14 of 15
246. (decrement c5)
   changed: (value c5) from 84 to 82
   goals met: 13 of 15
247. (decrement c5)
   changed: (value c5) from 82 to 80
   goals met: 13 of 15
248. (decrement c5)
   changed: (value c5) from 80 to 78
   goals met: 13 of 15
249. (decrement c5)
   changed: (value c5) from 78 to 76
   goals met: 13 of 15
250. (increase_rate c4)
   changed: (rate_value c4) from 4 to 5
   goals met: 13 of 15
251. (decrement c5)
   changed: (value c5) from 76 to 74
   goals met: 14 of 15
252. (decrement c4)
   changed: (value c4) from 83 to 78
   goals met: 13 of 15
253. (decrement c4)
   changed: (value c4) from 78 to 73
   goals met: 14 of 15
254. (decrement c3)
   changed: (value c3) from 82 to 74
   goals met: 13 of 15
255. (decrement c3)
   changed: (value c3) from 74 to 66
   goals met: 14 of 15
256. (decrement c2)
   changed: (value c2) from 81 to 71
   goals met: 13 of 15
257. (decrement c2)
   changed: (value c2) from 71 to 61
   goals met: 14 of 15
258. (increase_rate c1)
   changed: (rate_value c1) from 3 to 4
   goals met: 14 of 15
259. (increase_rate c1)
   changed: (rate_value c1) from 4 to 5
   goals met: 14 of 15
260. (decrement c1)
   changed: (value c1) from 79 to 74
   goals met: 13 of 15
261. (decrement c1)
   changed: (value c1) from 74 to 69
   goals met: 13 of 15
262. (decrement c1)
   changed: (value c1) from 69 to 64
   goals met: 13 of 15
263. (increase_rate c0)
   changed: (rate_value c0) from 4 to 5
   goals met: 13 of 15
264. (decrement c1)
   changed: (value c1) from 64 to 59
   goals met: 14 of 15
265. (decrement c0)
   changed: (value c0) from 77 to 72
   goals met: 14 of 15
266. (decrement c0)
   changed: (value c0) from 72 to 67
   goals met: 14 of 15
267. (decrement c0)
   changed: (value c0) from 67 to 62
   goals met: 14 of 15
268. (decrement c0)
   changed: (value c0) from 62 to 57
   goals met: 15 of 15
